[
    {
        "id": 1,
        "name": "Yangko Yogyakarta",
        "description": "Yangko adalah makanan kenyal yang terbuat dari tepung ketan, biasanya dijual dengan berbagai warna menarik.",
        "asal_usul": "Dahulu, Kotagede merupakan ibu kota Kerajaan Mataram Islam. Kerajaan ini merupakan cikal bakal Kasunanan Surakarta dan Kesultanan Jogja. Di kota inilah sejarah yangko bermula. Saat itu, makanan yangko dikenal sebagai makanan raja-raja atau para priyayi. Tidak semua rakyat biasa bisa menikmatinya. Bahkan, makanan yangko pernah dijadikan bekal makanan oleh Pangeran Diponegoro saat bergerilya karena dapat bertahan cukup lama.\n\nNama yangko diyakini berasal dari kata 'kiyangko'. Dalam pelafalan lidah orang Jawa, kata itu kemudian diucapkan menjadi 'yangko'. Konon, orang yang pertama kali mengenalkannya adalah Mbah Ireng. Meskipun Mbah Ireng sudah membuatnya sejak 1921, yangko baru mulai dikenal luas oleh masyarakat pada sekitar tahun 1939.\n\nUntuk mendapatkan yangko ini pun tak susah. Makanan kenyal ini banyak dijajakan di pusat-pusat jajanan atau pasar tradisional.",
        "resep": [
            "1 kilogram tepung terigu",
            "½ kilogram tepung ketan",
            "Air matang secukupnya",
            "2 sendok makan mentega",
            "¼ liter santan",
            "¼ sendok garam halus",
            "Pewarna makanan sesuai selera",
            "Selai melon atau buah lainnya sesuai selera."
        ],
        "cara_membuat": [
            "Campur tepung ketan dengan air matang. Aduk rata, kemudian saring dengan kain bersih.",
            "Masukkan mentega ke dalam adonan dan aduk rata.",
            "Tuangkan santan, tambahkan garam dan aduk hingga rata.",
            "Adonan di atas dibagi menjadi beberapa bagian, lalu masing-masing diberi pewarna makanan sesuai selera.",
            "Siapkan loyang persegi, lapisi dengan plastik bening. Lalu tuang adonan dan ratakan.",
            "Kukus adonan di atas api sedang hingga matang. Angkat dan dinginkan.",
            "Keluarkan yangko dari pengukusan dan loyang, lalu potonglah berbentuk kotak persegi atau sesuai selera.",
            "Kemudian gulingkan semua potongan tersebut di atas tepung terigu.",
            "Terakhir, bungkus setiap potongan kue dengan kertas minyak.",
            "Selesai! Kita bisa menambahkan berbagai varian rasa seperti rasa buah dari selai-selai buah yang tersedia."
        ],
        "referensi": "https://www.detik.com/jateng/kuliner/d-6746411/asal-usul-yangko-kue-kenyal-khas-jogja-cocok-jadi-buah-tangan",
        "image": "https://pumarentaljogja.com/images/artikel/mencicipi-kenikmatan-7-jenis-yangko-kotagede-jogja-wajib-bawa-pulang-untuk-oleholeh-1.jpeg"
    }
]
